#include <stdio.h>
#include <math.h>

// n=2, n=3, n=4 손계산 하면서 점화식을 찾기 또는 규칙을 찾기
// 재귀 -> f(3), f(n)-> 
// end codition! 

// f(1) = 1
// f(2) = 1
// f(3) = 1 + 1 = 2 = f(2) + f(1)
// f(4) = 2 + 1 = 3 = f(3) + f(2)
// f(5) = 2 + 3 = 5


int fib(int k){
    if(k == 1){ //  종료 조건
        
    }
    else if(k == 2){
        
    }
    else{
        
    }
}

// int digit_sum(k){
//     if(k == 1){
//         return 45;
//     }
//     else{
//         return (sum(1))*pow(10,n-1) + 10*sum(n-1);
//     }
// }

int main(){
    int x = fib(5);
    printf("%d", x);
    return 0;
}

// 자릿수합 1000000숫자들의 자릿수합

// 0 ~ 9 sum(1) = 45
// 0 ~ 99 sum(2)

// 0 1 2 ..... 9 (0*10 + sum(1))
// 10 11 12 .... 19 (1*10 + sum(1))
// 20 21 22 .....29 (2*10 + snum(1))
// ...
// 90 91 92 .....99 (9*10 + sum(1))

// sum(2) = (0~+9)*10 + 10*sum(1)
//      = 10*sum(1)

// 0 ~ 99     -> 0*100 + sum(2)
// 100 .. 199 -> 1*100 + sum(2)
// 200 .. 299 -> 2*100 + sum(2)
// ...
// 900 .. 999 -> 9*100 + sum(2)

// sum(3) =  (0~+9)*100 + 10*sum(2)

// sum(n) = (sum(1))*10^(n-1) + 10*sum(n-1)



